<template>
  <div class="food">
    <div class="box">
      <div class="co">
        <div class="p p1">
          <h1><router-link to="/lianxi" append>桃花源记</router-link></h1>
          <p>晋太元1中，武陵人2捕鱼为业3。缘4溪行5，忘路之远近6。忽逢7桃花林，夹岸8数百步，中无杂9树，芳草鲜美10，落英11缤纷12。渔人甚异之13。复14前15行，欲16穷17其林。
林尽水源18，便19得20一山，山有小口，仿佛21若22有光。便舍23船，从口入。初24极狭，才通人25。复行26数十步，豁然开朗27。土地平28旷29，屋舍30俨然31，有良田美池桑竹之32属33。阡陌34交通，鸡犬相闻35。其中往来种作36，男女衣着37，悉38如外人39。黄发垂髫40，并41怡然42自乐。
见渔人，乃大惊43，问所从来44，具45答之46。便要47还家，设酒杀鸡作食。村中闻有此人，咸48来问讯49。自云50先世51避秦时乱，率52妻子53邑人54来此绝境55，不复56出焉57，遂58与外人间隔59。问今是何世60，乃61不知有汉，无论62魏晋。此人一一为63具言64所闻65，皆叹惋66。余67人各复延至68其家，皆出酒食。停数日，辞去69。此中人语70云：“不足71为72外人道也。”
既73出，得其船，便扶向路74，处处志之75。及郡下76，诣77太守，说如此78。太守即遣人随其往，寻向所志79，遂80迷，不复得81路。
南阳刘子骥，高82尚士83也84，闻之，欣然85规86往。未果87，寻88病终89，后遂无问津90者。</p>
<router-view></router-view>
        </div>
        <div class="p p2">
          <h1>岳阳楼记</h1>
          <p>庆历四年春2，滕子京谪守巴陵郡3。越明年4，政通人和5，百废具兴6。乃重修岳阳楼7，增其旧制8，刻唐贤今人诗赋于其上9。属予作文以记之10。
予观夫巴陵胜状11，在洞庭一湖。衔远山12，吞长江13，浩浩汤汤14，横无际涯15；朝晖夕阴，气象万千16。此则岳阳楼之大观也17，前人之述备矣18。然则北通巫峡19，南极潇湘20，迁客骚人21，多会于此22，览物之情，得无异乎23？
若夫淫雨霏霏24，连月不开25，阴风怒号26，浊浪排空27；日星隐曜28，山岳潜形29；商旅不行30，樯倾楫摧31；薄暮冥冥32，虎啸猿啼。登斯楼也，则有去国怀乡33，忧谗畏讥34，满目萧然35，感极而悲者矣36。
至若春和景明37，波澜不惊38，上下天光39，一碧万顷；沙鸥翔集，锦鳞游泳40；岸芷汀兰41，郁郁青青42。而或长烟一空43，皓月千里44，浮光跃金45，静影沉璧46，渔歌互答47，此乐何极48！登斯楼也，则有心旷神怡49，宠辱偕忘50，把酒临风51，其喜洋洋者矣52。
嗟夫53！予尝求古仁人之心54，或异二者之为55。何哉？不以物喜，不以己悲56；居庙堂之高则忧其民57；处江湖之远则忧其君58。是进亦忧，退亦忧。然则何时而乐耶？其必曰：“先天下之忧而忧，后天下之乐而乐”乎59。噫！微斯人，吾谁与归60？
时六年九月十五日。 [1] </p>
        </div>
        <div class="p p3">
          <h1>陋室铭</h1>
          <p>山不在3高，有仙则名4。水不在深，有龙则灵5。斯是陋室6，
            惟吾德馨7。苔痕上阶绿，草色入帘青8。谈笑有鸿儒9，往来无白丁10。
            可以调素琴11，阅金经12。无丝竹13之14乱耳15，无案牍16之劳形17。
            南阳诸葛庐，西蜀子云亭18，孔子云19：何陋之有20？ [2] </p>
        </div>
        <div class="p p4">
          <h1>师说2</h1>
          <p>古之学者（1）必有师。师者，所以传道受业解惑也（2）
            。人非生而知之（3）者，孰能无惑？惑而不从师，其为惑也（4），
            终不解矣。生乎吾前（5），其闻（6）道也固先乎吾，吾从而师之（7）
；生乎吾后，其闻道也亦先乎吾，吾从而师之。吾师道也（8），夫庸知其年之先后生于吾乎（9）？是故（10）无（11）贵无贱，无长无少，道之所存师之所存也（12）。
嗟乎！师道（13）之不传也久矣！欲人之无惑也难矣！古之圣人，其出人（14）也远矣，犹且（15）从师而问焉；今之众人（16），其下（17）圣人也亦远矣，而耻学于师（18）。是故圣益圣，愚益愚（19）。圣人之所以为圣，愚人之所以为愚，其皆出于此乎?爱其子，择师而教之；于其身（20）也，则耻师焉，惑矣（21）。彼童子之师（22），授之书而习其句读（23）者，非吾所谓传其道解其惑者也。句读之不知（24），惑之不解，或师焉，或不焉（25），小学而大遗（26），吾未见其明也。巫医（27）乐师百工（28）之人，不耻相师（29）。士大夫之族（30），曰师曰弟子云者（31），则群聚而笑之。问之，则曰：“彼与彼年相若（32）也，道相似也，位卑则足羞，官盛则近谀（33）。”呜呼！师道之不复（34）可知矣。巫医乐师百工之人，君子（35）不齿（36），今其智乃（37）反不能及，其可怪也欤（38）！
圣人无常师（39）。孔子师郯子（40）、苌弘（41）、师襄（42）、老聃（43）。郯子之徒（44），其贤不及孔子。孔子曰：“三人行，则必有我师（45）”。是故弟子不必（46）不如师，师不必贤于弟子。闻道有先后，术业有专攻（47），如是而已。
李氏子蟠（48），年十七，好古文，六艺经传皆通习之（49），不拘于时（50），学于余。余嘉其能行古道（51），作《师说》以贻（52）之。 [1] </p>
        </div>
        <div class="p p1">
          <h1>桃花源记</h1>
          <p>晋太元1中，武陵人2捕鱼为业3。缘4溪行5，忘路之远近6。忽逢7桃花林，夹岸8数百步，中无杂9树，芳草鲜美10，落英11缤纷12。渔人甚异之13。复14前15行，欲16穷17其林。
林尽水源18，便19得20一山，山有小口，仿佛21若22有光。便舍23船，从口入。初24极狭，才通人25。复行26数十步，豁然开朗27。土地平28旷29，屋舍30俨然31，有良田美池桑竹之32属33。阡陌34交通，鸡犬相闻35。其中往来种作36，男女衣着37，悉38如外人39。黄发垂髫40，并41怡然42自乐。
见渔人，乃大惊43，问所从来44，具45答之46。便要47还家，设酒杀鸡作食。村中闻有此人，咸48来问讯49。自云50先世51避秦时乱，率52妻子53邑人54来此绝境55，不复56出焉57，遂58与外人间隔59。问今是何世60，乃61不知有汉，无论62魏晋。此人一一为63具言64所闻65，皆叹惋66。余67人各复延至68其家，皆出酒食。停数日，辞去69。此中人语70云：“不足71为72外人道也。”
既73出，得其船，便扶向路74，处处志之75。及郡下76，诣77太守，说如此78。太守即遣人随其往，寻向所志79，遂80迷，不复得81路。
南阳刘子骥，高82尚士83也84，闻之，欣然85规86往。未果87，寻88病终89，后遂无问津90者。</p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'food',
  mounted () {
    let num = 0
    const tiemr = setInterval(function () {
      num -= 375
      if (num <= -375 * 5) {
        num = 0
        $('.co').css({
        marginLeft: num + 'px'
      })
        return
      }
      $('.co').animate({
        marginLeft: num
      },1000)
    }, 2000);
  }
}
</script>

<style lang="scss" scoped>
  .box{
    width: 100%;
    height: 1448px;
    overflow: hidden;

    .co {
      width: 375px * 5;
      display: flex;
    }

    div{
      width: 375px;
      height: 100%;
    }
    .p1{
      background-color: yellow;
    }
     .p2{
      background-color: rebeccapurple;
    }
     .p3{
      background-color: red;
    }
     .p4{
      background-color: green;
    }
  }
  h1{
    text-align: center;
    font-size: 35px;
  }
  p{
    padding: 10%;
    text-indent: 20px;
  }
</style>
